prod-deploy/results/prod-02-2-p1-baseline-20260722/round-1-stable/round-1/mseqwrite-A4/fio.txt
mseqwrite: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 16 processes
mseqwrite: Laying out IO file (1 file / 4096MiB)
mseqwrite: Laying out IO file (1 file / 4096MiB)
mseqwrite: Laying out IO file (1 file / 4096MiB)
[...]

mseqwrite: (groupid=0, jobs=16): err= 0: pid=1409751: Thu Jul 23 13:24:50 2026
  write: IOPS=1003, BW=4013MiB/s (4208MB/s)(64.0GiB/16329msec); 0 zone resets
    clat (usec): min=1397, max=66641, avg=15024.50, stdev=5625.01
     lat (usec): min=1397, max=66642, avg=15024.76, stdev=5625.02
    clat percentiles (usec):
     |  1.00th=[ 1909],  5.00th=[ 2409], 10.00th=[12125], 20.00th=[13960],
     | 30.00th=[14222], 40.00th=[14484], 50.00th=[14615], 60.00th=[14746],
     | 70.00th=[15008], 80.00th=[15401], 90.00th=[24249], 95.00th=[24773],
     | 99.00th=[26608], 99.50th=[34341], 99.90th=[36963], 99.95th=[56361],
     | 99.99th=[66323]
   bw (  MiB/s): min= 3703, max= 4568, per=100.00%, avg=4033.27, stdev=15.39, samples=254
   iops        : min=  880, max= 1242, avg=1008.48, stdev= 5.38, samples=510
  lat (msec)   : 2=1.86%, 4=5.09%, 10=2.75%, 20=75.42%, 50=14.81%
  lat (msec)   : 100=0.07%
  cpu          : usr=4.76%, sys=1.05%, ctx=524935, majf=1, minf=201
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4013MiB/s (4208MB/s), 4013MiB/s-4013MiB/s (4208MB/s-4208MB/s), io=64.0GiB (68.7GB), run=16329-16329msec